balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18LF27J53.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IF" edc:desc="" edc:mask="0x1" edc:name="CCP3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4IF" edc:desc="" edc:mask="0x1" edc:name="CCP4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5IF" edc:desc="" edc:mask="0x1" edc:name="CCP5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP6IF" edc:desc="" edc:mask="0x1" edc:name="CCP6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP7IF" edc:desc="" edc:mask="0x1" edc:name="CCP7IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP8IF" edc:desc="" edc:mask="0x1" edc:name="CCP8IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP9IF" edc:desc="" edc:mask="0x1" edc:name="CCP9IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10IF" edc:desc="" edc:mask="0x1" edc:name="CCP10IF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="IPR4" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IP" edc:desc="" edc:mask="0x1" edc:name="CCP3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4IP" edc:desc="" edc:mask="0x1" edc:name="CCP4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5IP" edc:desc="" edc:mask="0x1" edc:name="CCP5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP6IP" edc:desc="" edc:mask="0x1" edc:name="CCP6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP7IP" edc:desc="" edc:mask="0x1" edc:name="CCP7IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP8IP" edc:desc="" edc:mask="0x1" edc:name="CCP8IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP9IP" edc:desc="" edc:mask="0x1" edc:name="CCP9IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10IP" edc:desc="" edc:mask="0x1" edc:name="CCP10IP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIE5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIE5" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:desc="" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIE" edc:desc="" edc:mask="0x1" edc:name="TMR5GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IE" edc:desc="" edc:mask="0x1" edc:name="TMR5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:desc="" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR8IE" edc:desc="" edc:mask="0x1" edc:name="TMR8IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM3IE" edc:desc="" edc:mask="0x1" edc:name="CM3IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="TRISA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111-1111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="111-1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xff" edc:name="TRISA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISB" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xff" edc:name="TRISB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="TRISC" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11---111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11---111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:mask="0xff" edc:name="TRISC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="T3GCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuxuu" edc:name="T3GCON" edc:nzwidth="8" edc:por="00000x00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3GSS0" edc:desc="" edc:mask="0x1" edc:name="T3GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSS1" edc:desc="" edc:mask="0x1" edc:name="T3GSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GVAL" edc:desc="" edc:mask="0x1" edc:name="T3GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GGO_T3DONE" edc:desc="" edc:mask="0x1" edc:name="T3GGO_T3DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSPM" edc:desc="" edc:mask="0x1" edc:name="T3GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GTM" edc:desc="" edc:mask="0x1" edc:name="T3GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPOL" edc:desc="" edc:mask="0x1" edc:name="T3GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GE" edc:desc="" edc:mask="0x1" edc:name="TMR3GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T3GGO" edc:desc="" edc:mask="0x1" edc:name="T3GGO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="nT3DONE" edc:desc="" edc:mask="0x1" edc:name="nT3DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIR5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIR5" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:desc="" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIF" edc:desc="" edc:mask="0x1" edc:name="TMR5GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IF" edc:desc="" edc:mask="0x1" edc:name="TMR5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:desc="" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR8IF" edc:desc="" edc:mask="0x1" edc:name="TMR8IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM3IF" edc:desc="" edc:mask="0x1" edc:name="CM3IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
